/* От конзолата се четат 3 реда:
1.	Брой страници в текущата книга – цяло число в интервала [1…1000]
2.	Страници, които прочита за 1 час – цяло число в интервала [1…1000]
3.	Броят на дните, за които трябва да прочете книгата – 
цяло число в интервала [1…1000]
За лятната ваканция в списъка със задължителна литература на Жоро има 
определен брой книги. Понеже Жоро предпочита да играе с приятели навън,
 вашата задача е да му помогнете да изчисли колко часа на ден трябва да отделя
 , за да прочете необходимата литература.
 */
function vacationBooksList (input)
{
  let numPages = Number(input[0]);
  let pagesByhour = Number(input[1]);
  let daysForReading = Number (input[2]);

  let hoursPerDay = (numPages/pagesByhour) / daysForReading;

  console.log (hoursPerDay)

}

vacationBooksList(["432 ",
"15 ",
"4 "])
