/* Румен иска да пребоядиса хола и за целта е наел майстори. Напишете програма, 
която изчислява разходите за ремонта, предвид следните цени:
•	Предпазен найлон - 1.50 лв. за кв. метър
•	Боя - 14.50 лв. за литър
•	Разредител за боя - 5.00 лв. за литър
За всеки случай, към необходимите материали,
 Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон, разбира се и 0.40 лв. за торбички.
  Сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от сбора на всички разходи за материали.

Изход
Да се отпечата на конзолата един ред:
•	"{сумата на всички разходи}"
 */
function repainting (input)
{
  let numNailon = Number (input[0]);
  let numPaint = Number (input[1]);
  let numThinner = Number (input[2]);
  let numHours = Number (input[3]);

    let allExpense = (numNailon + 2) * 1.50 + (numPaint + numPaint * 10/100) * 14.50 +  + numThinner * 5 + 0.40;
   let priceForPainters = numHours * (allExpense * 30/100);

  console.log(allExpense + priceForPainters);
}

repainting(["5 ",
"10 ",
"10 ",
"1 "])
