function basketballEquipment (input)
{
  let annualFee = Number (input[0]);

  let priceSneakers = annualFee - (annualFee *40/100);
  let priceOutfit = priceSneakers - priceSneakers * 20/100;
  let priceBall = priceOutfit / 4;
  let priceAccessories = priceBall/5;

  let totalPrice = annualFee +priceSneakers + priceOutfit + priceBall + priceAccessories;

  console.log(totalPrice);

}
basketballEquipment(["365 "])

/* Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка. 
Напишете програма, която изчислява какви разходи ще има Джеси, ако започне да тренира, 
като знаете колко е таксата за тренировки по баскетбол за период от 1 година. Нужна екипировка: 
•	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
•	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
•	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
•	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
Вход
От конзолата се четe 1 ред:
•	Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]
Изход
Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол.
 Цена на тренировките за година: 365
Цена на баскетболните кецове: 365 – 40% = 219
Цена на баскетболен екип: 219 – 20% = 175.20
Цена на баскетболна топка: 1 / 4 от 175.20 = 43.80
Цена на баскетболни аксесоари: 1 /  5 от 43.80 = 8.76
Обща цена за екипировката: 365 + 219 + 175.20 + 43.80 + 8.76 = 811.76

*/