function multiplyTable (input){
let num = Number(input[0]);

let digit1 = 0;
let digit2 = 0;
let digit3 = 0;

digit1 = num % 10;

digit2 = (num/10)% 10;

digit3= num/100;

for( let a = 1; a <= digit1;a++){
    for (let b = 1;b<= digit2;b++){
        for(let c = 1;c <= digit3;c++){
             console.log(`${a} * ${b} * ${c} = ${a*b*c};`);

        }
    }

}


}

multiplyTable(["324"])

/* Най-малкият син на семейство Иванови все още не знае таблицата за умножение. 
Веднага след коледните празници, той ще има контролно и вие трябва да му помогнете да я научи.
 Вашата задача е да съставите програма,
  в която се въвежда цяло трицифрено число и се извежда таблицата за умножение. 
  Поради особености на Вашата програма, тя взима цифрите на въведеното число в обратен ред. 
  Максималната стойност на множителите е определена от всяка една от 3-те цифри на въведеното число.
Вход
Входът е цяло трицифрено число в интервала [111…999].
Изход
Да се отпечатат на конзолата няколко на брой реда в следния формат:
"{първата цифра} * {втората цифра} * {третата цифра} = {резултатът от умножението на трите цифри};"
Първата, втората и третата цифра не могат да бъдат отрицателни числа или равни на 0!
 */