function onTimeForTheExam (input)
{
let hourForExam = Number(input[0]);
let minuteForExam = Number(input[1]);
let hourArrive = Number(input[2]);
let minuteArrive = Number(input[3]);

let totalMinuteForExam = hourForExam * 60 + minuteForExam;
let totalMinuteArrive = hourArrive * 60 + minuteArrive;

let difference = Math.abs(totalMinuteForExam - totalMinuteArrive);
let hour = Math.floor(difference / 60);
let  minutes = difference % 60;


if ( totalMinuteArrive >totalMinuteForExam){

}

}

onTimeForTheExam(["9",
"30",
"9",
"50"])


/*Студент трябва да отиде на изпит в определен час (например в 9:30 часа). 
Той идва в изпитната зала в даден час на пристигане (например 9:40). 
Счита се, че студентът е дошъл навреме, ако е пристигнал в часа на изпита или до половин час преди това.
 Ако е пристигнал по-рано повече от 30 минути, той е подранил. Ако е дошъл след часа на изпита, 
 той е закъснял. Напишете функция, която получава време на изпит и време на пристигане и 
 отпечатва дали студентът е дошъл навреме, дали е подранил или е закъснял и с колко часа
  или минути е подранил или закъснял.
Вход
Приемат се 4 аргумента:
•	Първият съдържа час на изпита – цяло число от 0 до 23.
•	Вторият съдържа минута на изпита – цяло число от 0 до 59.
•	Третият съдържа час на пристигане – цяло число от 0 до 23.
•	Четвъртият съдържа минута на пристигане – цяло число от 0 до 59.
Изход
На първият ред отпечатайте:
•	"Late", ако студентът пристига по-късно от часа на изпита.
•	"On time", ако студентът пристига точно в часа на изпита или до 30 минути по-рано.
•	"Early", ако студентът пристига повече от 30 минути преди часа на изпита.
Ако студентът пристига с поне минута разлика от часа на изпита, отпечатайте на следващия ред:
•	"mm minutes before the start" за идване по-рано с по-малко от 1.
•	"hh:mm hours before the start" за подраняване с 1 час или повече. 
Минутите винаги печатайте с 2 цифри, например "1:05".
•	 "mm minutes after the start" за закъснение под час.
•	"hh:mm hours after the start" за закъснение от 1 час или повече. 
Минутите винаги печатайте с 2 цифри, например "1:03".
  */