function test(input) {

    let max_n1 = Number(input[0]);
    let max_n2 = Number(input[1]);
    let max_n3 = Number(input[2]);
   

    for (let num1 = 2; num1 <= max_n1; num1 += 2) {

        for (let num2 = 2; num2 <= max_n2; num2++) {
            if (num2 == 2 || num2 == 3 || num2 == 5 || num2 == 7) {

                for (let num3 = 2; num3 <= max_n3; num3 += 2) {


                    
                    console.log(`${num1} ${num2} ${num3}`);
                }
            }
        }
    }
    
}
test ([8,
2,
8])

/* Да се напише програма, която генерира трицифрени PIN кодове, 
като цифрите на всеки PIN код са в определен интервал.
 За да бъде валиден един PIN код той трябва да отговаря на следните условия:
•	Първата и третата цифра трябва да бъдат четни.
•	Втората цифра трябва да бъде просто число в диапазона [2...7].
Вход
От конзолата се четат 3 реда:
•	Горната граница на първото число - цяло число в диапазона [1...9]
•	Горната граница на второто число - цяло число в диапазона [1...9]
•	Горната граница на третото число - цяло число в диапазона [1...9]
Изход
Да се отпечатат на конзолата всички валидни трицифрени PIN кодове,
 чиито цифри отговарят на съответните интервали.
 */