function safePasswordsGenerator (input){

}

safePasswordsGenerator([2,
    3,
    10
    ])

/* Ани се страхува от това, да не й бъде хакнат някой от профилите в социалните мрежи,
 затова решава да направи генератор за пароли, които да бъдат достатъчно сигурни. 
 Вашата задача е да й помогнете да напише програма, която ще генерира тези пароли,
  разделени една от друга от знака "|".
Да се напише програма, която генерира серия от символи като в шаблона:
ABxyBA 
като при всяко генериране на нов код, стойностите на символите се увеличават с 1.
 Ако A надхвърли 55, се връща на 35. Ако B надхвърли 96, се връща на 64.
Вход
От конзолата се чете 1 ред:
•	На първия ред a – цяло число в интервала [1 … 1000]
•	На втория ред b – цяло число в интервала [1 … 1000]
•	На третия ред максимален брой генерирани пароли – цяло число в интервала [1 … 1000000]
Ограничения:
•	A е символ с ASCII стойност в диапазона [35… 55]
•	B е символ с ASCII стойност в диапазона [64 … 96]
•	x e цяло число в диапазона [1… a] 
•	y e цяло число в диапазона [1… b] 
Изход:
Да се отпечата на конзолата:
•	Генерираният код. Ако броят на комбинациите е по-голям от максималния на кода, 
да се отпечата до подадената стойност, в противен случай да се отпечата до текущия брой на комбинациите.
 */