function profit (input){
    let oneLevCoins = Number(input[0])
    let twoLevCoins = Number(input[1])
    let fiveLevCoins = Number(input[2])
    let sum = Number(input[3])

    for (let one = 0; one <= oneLevCoins; one++) {
        for (let two = 0; two <= twoLevCoins; two++) {
            for (let five = 0; five <= fiveLevCoins; five++) {
                if (one * 1 + two * 2 + five * 5 == sum) {
                    console.log(`${one} * 1 lv. + ${two} * 2 lv. + ${five} * 5 lv. = ${sum} lv.`);
                }
            }
        }
    }

}

profit([3,
    2,
    3,
    10
    ])

/* Имаме банкноти и монети по 1лв., по 2лв. и по 5лв. Да се напише програма, 
която прочита въведените от потребителя брой банкноти и монети и сума, 
и извежда на екран всички възможни начини по които сумата може да се изплати с наличните банкноти. 
Вход
Входът се чете от конзолата и съдържа точно 4 реда:
1.	Брой монети по 1лв. - цяло положително число; 
2.	Брой монети по 2лв. - цяло положително число;
3.	Брой банкноти по 5лв. - цяло положително число;
4.	Сума - цяло положително число в интервала [1…1000];
Изход
Да се отпечатат на конзолата всички комбинации от дадените номинали, образуващи сумата, 
форматирани по следния начин:
o	"{бр. 1лв.} * 1 lv. + {бр. 2лв.} * 2 lv. + {бр. 5лв.} * 5 lv. = {сума} lv."
 */