function primePairs  (input){
    firstNum = Number(input[0]);
    secondNum = Number(input[1]);
    increaseFirst = Number(input[2]);
    increaseSecond = Number(input[3]);
     
    let maxFirst = firstNum + increaseFirst;
    let maxSecond = secondNum + increaseSecond;
     
    for (let i = firstNum; i <= maxFirst; i++) {
        for (let j = secondNum; j <= maxSecond; j++) {
            let isFirstNumPrime = true;
            let isSecondNumPrime = true;
            for (let k = 2; k <= Math.sqrt(i); k++) {
                if ( i % k == 0) {
                    isFirstNumPrime = false;
                    break;
                }
            }
            for (let k = 2; k <= Math.sqrt(j); k++) {
                if ( j % k == 0) {
                    isSecondNumPrime = false;
                    break;
                }
            }
            if (isFirstNumPrime && isSecondNumPrime) {
                console.log(`${i}${j}`)
            }
        }
    }
}

primePairs([10,
    20,
    5,
    5
    
    ])

/* Напишете програма, която генерира и принтира на конзолата четирицифрени числа,
 в които първата и втората двойка цифри образуват двуцифрени прости числа (пример за такова число 1723).
  Крайната стойност до която трябва да се генерират двойките се определя от други 2 цифри, подадени като вход, 
  които определят с колко крайната стойност е по-голяма от началната.
Вход
От конзолата се четат четири реда:
•	На първия ред – началната стойност на първите първата двойка числа – цяло положително число в
 диапазона [10… 90]
•	На втория ред – началната стойност на втората двойка числа – цяло положително число в диапазона [10… 90]
•	На третия ред – разликата между началната и крайната стойност на  първата двойка числа – 
цяло положително число в диапазона [1… 9]
•	На четвъртия ред – разликата между началната и крайната стойност на  
втората двойка числа – цяло положително число в диапазона [1… 9]
Изход:
Да се отпечатат на конзолата четирицифрените числа, в които първите две и
 вторите две цифри са прости двуцифрени числа.
 */