function footballLeague (input){
 let capability = Number (input[0]);
 let fens = Number (input[1]);

 let fensSA = 0;
 let fensSB = 0;
 let fensSV = 0;
 let fensSG = 0;
 
 for (let i = 2; i <=fens + 1 ; i++){
    let sector = input[i];

    if (sector === 'A'){
        fensSA++;
    }
    else if (sector === 'B'){
       fensSB++;
    }
    else if (sector === 'V'){
    fensSV++;
    }
    else if (sector === 'G'){
   fensSG++;
    }
 }
 


 console.log(`${((fensSA /fens)*100).toFixed(2)}%`);
 console.log(`${((fensSB /fens)*100).toFixed(2)}%`);
 console.log(`${((fensSV /fens)*100).toFixed(2)}%`);
 console.log(`${((fensSG /fens)*100).toFixed(2)}%`);
 console.log(`${((fens/capability)*100).toFixed(2)}%`);
 

}

footballLeague([76,
    10,
    'A',
    'V',
    'V',
    'V',
    'G',
    'B',
    'A',
    'V',
    'B',
    'B'
    ])

/*  Екипът на СофтУни си организира футболен турнир. 
Първоначално прочитаме от конзолата капацитета на стадиона и броят на всички фенове.
 След това за всеки фен се чете секторът, в който се намира. Феновете на първия отбор са в сектор А и Б,
  а на втория – В и Г. Да се напише програма, която изчислява процентите на феновете във всеки сектор,
   спрямо общия брой фенове на стадиона, както и общият процент на феновете за двата отбора, 
   спрямо капацитета на стадиона. Общият брой на феновете НЕ надвишава капацитета на стадиона.
Вход
От конзолата се четат поредица от числа, всяко на отделен ред:
1.	Капацитетът на стадиона – цяло число в интервала [1 … 10000];
2.	Броят на всички фенове – цяло число в интервала [1 … 10000].
За всеки един фен, на отделен ред се прочита:
1.	Секторът, на който се намира – текст – "A", "B", "V" и "G".
Изход
Да се отпечатат на конзолата 5 реда, всеки от които съдържа процент между 0.00% и 100.00%, 
форматирани до втората цифра след десетичната запетая:
1.	Процентът на феновете в сектор А
2.	Процентът на феновете в сектор Б
3.	Процентът на феновете в сектор В
4.	Процентът на феновете в сектор Г
5.	Процентът на всички фенове, спрямо капацитета на стадиона.
*/