function addBags (input){
let priceForBags20kg = Number(input[0]);
let totalKgBags = Number(input[1]);
let daysBeforeFly = Number(input[2]);
let numOfBags = Number(input[3]);

let totalSum = 0;
if (totalKgBags < 10){
    totalSum = numOfBags * (priceForBags20kg * 0.20);

}
else if(totalKgBags >= 10 && totalKgBags <= 20 ){
 totalSum = numOfBags * (priceForBags20kg * 0.50);
}
else{
    totalSum = numOfBags * priceForBags20kg;  
}

if (daysBeforeFly > 30){
 totalSum += totalSum * 0.10;
}else if ( daysBeforeFly >= 7 && daysBeforeFly <= 30){
    totalSum += totalSum * 0.15;
}else{
    totalSum += totalSum * 0.40;
}



console.log(`The total price of bags is: ${totalSum.toFixed(2)} lv.`);
}

addBags(["63.80",
"23",
"3",
"1"])



  
/*
Мими има закупени самолетни билети, но в последствие решава да си добави багаж към тях.
Таксите за багаж се изчисляват въз основа на теглото на чекирания багаж:
•	до 10кг – 20% от цената на багаж над 20кг
•	между 10кг и 20кг вкл. – 50% от цената на багаж над 20кг.
•	над 20кг – таксата се чете от конзолата
В зависимост от броя на дните, които остават до пътуването, цената се оскъпява:
•	повече от 30 дни - цената на багажа се оскъпява с 10%
•	между 7 и 30 дни вкл. - цената на багажа се оскъпява с 15%
•	по-малко от 7 дни - цената на багажа се оскъпява с 40%
Напишете програма, която пресмята колко ще трябва да заплати Мими, спрямо горните условия.
Вход:
От конзолата се четат 4 реда:
1.	Цената на багаж над 20кг - реално число в диапазона [10.0…80.0]
2.	Килограми на багажа – реално число в диапазона [1.0…32.0]
3.	Дни до пътуването – цяло число в диапазона [1…60]
4.	Брой багажи – цяло число в диапазона [1…10]
Изход
Да се отпечата на конзолата сумата, която ще трябва да заплати Мими за багажите, в следния формат:
•	" The total price of bags is: {цената на багажите} lv. "
Сумата да бъде форматирана до втората цифра след десетичния знак.

*/