function transportPrice(input)
{
  let km = Number(input[0]);
  let tariff = input[1];
  let transport = '';
  
  let totalPrice = 0;

  if (km < 20){
     transport = 'Taxi';
    switch(tariff){
        case 'day':
            totalPrice = 0.70 + (km * 0.79);
            break;
            case 'night':
                totalPrice = 0.70 + (km * 0.90);
                break;
    
    }
  
  }
  else if (km >= 20 &&  km < 100){
    transport = 'Bus'
    totalPrice = km * 0.09;

  }
  else if (km >=100){
    transport = 'Train';
    totalPrice = km * 0.06;
  }
console.log(totalPrice.toFixed(2));

}

transportPrice([7,
    'night'
    
    ])

/* Студент трябва да пропътува n километра. Той има избор измежду три вида транспорт:
•	Такси. Начална такса: 0.70 лв. Дневна тарифа: 0.79 лв. / км. Нощна тарифа: 0.90 лв. / км.
•	Автобус. Дневна / нощна тарифа: 0.09 лв. / км. Може да се използва за разстояния минимум 20 км.
•	Влак. Дневна / нощна тарифа: 0.06 лв. / км. Може да се използва за разстояния минимум 100 км.
Напишете програма, която въвежда броя километри n и период от деня (ден или нощ) и изчислява цената на най-евтиния транспорт.
Вход
От конзолата се четат два реда:
•	Първият ред съдържа числото n – брой километри – цяло число в интервала [1…5000]
•	Вторият ред съдържа дума “day” или “night” – пътуване през деня или през нощта
Изход
Да се отпечата на конзолата най-ниската цена за посочения брой километри, 
форматирана до втория знак след десетичния разделител.
 */